modules_cxf_src_test_java_org_mule_runtime_module_cxf_issues_ProxyMule6829TestCase.java/[CN]/ProxyMule6829TestCase/[MT]/testProxyServerSoap12Op1()/body

{
  FunctionalTestComponent testComponent=(FunctionalTestComponent)getComponent("soap12Flow");
  testComponent.setEventCallback(testCxfEventCallback);
  String msgEchoOperation1="<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:new=\"http://new.webservice.namespace\">" + "<soap:Header/>" + "  <soap:Body>"+ "    <new:parameter1>hello world</new:parameter1>"+ "  </soap:Body>"+ "</soap:Envelope>";
  String soapOperation="EchoOperation1";
  InternalMessage response=executeSoap12Call(msgEchoOperation1,soapOperation);
  assertTrue(latch.await(1000,TimeUnit.MILLISECONDS));
  String cxfOperationName=testCxfEventCallback.getCxfOperationName();
  assertEquals(soapOperation,cxfOperationName);
  String payload=getPayloadAsString(response);
  assertTrue(payload.contains("<new:parameter1"));
  assertTrue(payload.contains("hello world"));
}
